Revit 2026 API

# IFCLinkDocumentExportScope Properties

---

The IFCLinkDocumentExportScope type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

IFCLinkDocumentExportScope Class

Autodesk.Revit.DB.IFC Namespace